romanzhukovv/vscode-tools/cmsis-svd-master/data/NXP/LPC18xx_svd_v18.svd
<?xml version="1.0" encoding="utf-8"?> 


<device schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
	xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd">
	<name>LPC18xx</name>
	<version>18</version>
	<description>Register cmsis file for LPC18xx parts</description>
	<!-- Bus Interface Properties -->
	<!-- Cortex-M3 is byte addressable -->
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<size>32</size>
	<!--
		Software that is described herein is for illustrative purposes only
		which provides customers with programming information regarding the
		products. This software is supplied "AS IS" without any warranties.
		NXP Semiconductors assumes no responsibility or liability for the
		use of the software, conveys no license or title under any patent,
		copyright, or mask work right to the product. NXP Semiconductors
		reserves the right to make changes in the software without
		notification. NXP Semiconductors also make no representation or
		warranty that such application will be suitable for the specified
		use without further testing or modification.	
		
	-->	



 

	<headerFile>
		<prefixes>
			<peripheral>LPC_</peripheral>
		</prefixes>
	</headerFile>






	<peripherals>
		<peripheral>
			<name>SCT</name>
			<description>Product name title=UM10430 Chapter title=LPC18xx State Configurable Timer (SCT) Modification date=1/18/2011 Major revision=0 Minor revision=7 </description>
			<groupName>SCT</groupName>
			<baseAddress>0x40000000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SCT</name>
				<value>10</value>

			</interrupt>
			<registers>
				<register>
					<name>CONFIG</name>
					<description>SCT configuration register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00007E00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>UNIFY</name>
							<description>SCT operation</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>16_BIT_COUNTERS</name>
									<description>The SCT operates as two 16-bit counters named L and H.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_BIT_UNIFIED</name>
									<description>The SCT operates as a unified 32-bit counter.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKMODE</name>
							<description>SCT clock mode</description>
							<bitRange>[2:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>BUS_CLOCK</name>
									<description>The SCT and prescaler(s) are clocked by the bus clock.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_PERFORMANCE</name>
									<description>The SCT clock is the bus clock, but the prescaler(s) is (are) enabledto count only when sampling of the input selected by the CKSEfield finds the selected edge. The minimum pulse width on theclock input is 1 bus clock period. This is the highperformance sampled-clock mode.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW_POWER</name>
									<description>The SCT and prescaler(s) are clocked by the input selected by CKSEL, synchronized to the bus clock and possibly inverted. The minimum pulse width on the clock input is 1 bus clock  period. This is the low-power sampled-clock mode.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_EDGE</name>
									<description>The SCT and prescaler(s) are clocked by the input edge selected by the CKSEL field. In this mode the following is true: Most of the SCT is clocked by the (selected polarity of the)  input. Outputs are switched synchronously to the input clock. The input clock rate must be at least half the bus clock rate and  can be faster than the bus clock.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKSEL</name>
							<description>SCT clock select</description>
							<bitRange>[6:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INP0_RISING</name>
									<description>Rising edges on input 0.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP0_FALLING</name>
									<description>Falling edges on input 0.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP1_RISING</name>
									<description>Rising edges on input 1.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP1_FALLING</name>
									<description>Falling edges on input 1.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP2_RISING</name>
									<description>Rising edges on input 2.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP2_FALLING</name>
									<description>Falling edges on input 2.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP3_RISING</name>
									<description>Rising edges on input 3.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP3_FALLING</name>
									<description>Falling edges on input 3.</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP4_RISING</name>
									<description>Rising edges on input 4.</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP4_FALLING</name>
									<description>Falling edges on input 4.</description>
									<value>0x9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP5_RISING</name>
									<description>Rising edges on input 5.</description>
									<value>0xA</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP5_FALLING</name>
									<description>Falling edges on input 5.</description>
									<value>0xB</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP6_RISING</name>
									<description>Rising edges on input 6.</description>
									<value>0xC</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP6_FALLING</name>
									<description>Falling edges on input 6.</description>
									<value>0xD</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP7_RISING</name>
									<description>Rising edges on input 7.</description>
									<value>0xE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP7_FALLING</name>
									<description>Falling edges on input 7.</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NORELAODL_NORELOADU</name>
							<description>A 1 in this bit prevents the lower match registers from being  reloaded from their respective reload registers. Software can  write to set or clear this bit at any time. This bit applies to both the  higher and lower registers when the UNIFY bit is set.</description>
							<bitRange>[7:7]</bitRange>
							
