romanzhukovv/vscode-tools/cmsis-svd-master/data/NXP/LPC18xx_svd_v18.svd
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:29]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>LIMIT</name>
					<description>SCT limit register</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LIMMSK_L</name>
							<description>If bit n is one, event n is used as a counter limit for the L or unified counter (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>LIMMSK_H</name>
							<description>If bit n is one, event n is used as a counter limit for the H counter (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>HALT</name>
					<description>SCT halt condition register</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HALTMSK_L</name>
							<description>If bit n is one, event n sets the HALT_L bit in the SCTCTRL register (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>HALTMSK_H</name>
							<description>If bit n is one, event n sets the HALT_H bit in the SCTCTRL register (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STOP</name>
					<description>SCT stop condition register</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STOPMSK_L</name>
							<description>If bit n is one, event n sets the STOP_L bit in the SCTCTRL register (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>STOPMSK_H</name>
							<description>If bit n is one, event n sets the STOP_H bit in the SCTCTRL register (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>START</name>
					<description>SCT start condition register</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STARTMSK_L</name>
							<description>If bit n is one, event n clears the STOP_L bit in the SCTCTRL register (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>STARTMSK_H</name>
							<description>If bit n is one, event n clears the STOP_H bit in the SCTCTRL register (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>COUNT</name>
					<description>SCT counter register</description>
					<addressOffset>0x040</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CTR_L</name>
							<description>When UNIFY = 0, read or write the 16-bit L counter value. When UNIFY = 1, read or write the lower 16 bits of the 32-bit unified counter.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>CTR_H</name>
							<description>When UNIFY = 0, read or write the 16-bit H counter value. When UNIFY = 1, read or write the upper 16 bits of the 32-bit unified counter.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STATE</name>
					<description>SCT state register</description>
					<addressOffset>0x044</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STATE_L</name>
							<description>State variable.</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[15:5]</bitRange>
						</field>
						<field>
							<name>STATE_H</name>
							<description>State variable.</description>
							<bitRange>[20:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:21]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INPUT</name>
					<description>SCT input register</description>
					<addressOffset>0x048</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>AIN0</name>
							<description>Real-time status of input 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>AIN1</name>
							<description>Real-time status of input 1.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>AIN2</name>
							<description>Real-time status of input 2.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>AIN3</name>
							<description>Real-time status of input 3.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>AIN4</name>
							<description>Real-time status of input 4.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>AIN5</name>
							<description>Real-time status of input 5.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>AIN6</name>
							<description>Real-time status of input 6.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>AIN7</name>
							<description>Real-time status of input 7.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>SIN0</name>
							<description>Input 0 state synchronized to the SCT clock.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>SIN1</name>
							<description>Input 1 state synchronized to the SCT clock.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>SIN2</name>
							<description>Input 2 state synchronized to the SCT clock.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>SIN3</name>
							<description>Input 3 state synchronized to the SCT clock.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>SIN4</name>
							<description>Input 4 state synchronized to the SCT clock.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>SIN5</name>
							<description>Input 5 state synchronized to the SCT clock.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>SIN6</name>
							<description>Input 6 state synchronized to the SCT clock.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>SIN7</name>
							<description>Input 7 state synchronized to the SCT clock.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>REGMODE</name>
					<description>SCT match/capture registers mode register</description>
					<addressOffset>0x04C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REGMOD_L0</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>REGMOD_L1</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>REGMOD_L2</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>REGMOD_L3</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>REGMOD_L4</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>REGMOD_L5</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>REGMOD_L6</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>REGMOD_L7</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>REGMOD_L8</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>REGMOD_L9</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>REGMOD_L10</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>REGMOD_L11</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>REGMOD_L12</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>REGMOD_L13</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>REGMOD_L14</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>REGMOD_L15</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>REGMOD_H16</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>REGMOD_H17</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>REGMOD_H18</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>REGMOD_H19</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>REGMOD_H20</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>REGMOD_H21</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>REGMOD_H22</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>REGMOD_H23</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>REGMOD_H24</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>REGMOD_H25</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>REGMOD_H26</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>REGMOD_H27</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>REGMOD_H28</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>REGMOD_H29</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>REGMOD_H30</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>REGMOD_H31</name>
							<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
