romanzhukovv/vscode-tools/cmsis-svd-master/data/NXP/LPC18xx_svd_v18.svd
				<register>
					<name>OUTPUT</name>
					<description>SCT output register</description>
					<addressOffset>0x050</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>OUT0</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>OUT1</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>OUT2</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>OUT3</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>OUT4</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>OUT5</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>OUT6</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>OUT7</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>OUT8</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>OUT9</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>OUT10</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>OUT11</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>OUT12</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>OUT13</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>OUT14</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>OUT15</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>OUTPUTDIRCTRL</name>
					<description>SCT output counter direction control register</description>
					<addressOffset>0x054</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETCLR0</name>
							<description>Set/clear operation on output 0. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR1</name>
							<description>Set/clear operation on output 1. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR2</name>
							<description>Set/clear operation on output 2. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR3</name>
							<description>Set/clear operation on output 3. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[7:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR4</name>
							<description>Set/clear operation on output 4. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR5</name>
							<description>Set/clear operation on output 5. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[11:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR6</name>
							<description>Set/clear operation on output 6. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[13:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR7</name>
							<description>Set/clear operation on output 7. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[15:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR8</name>
							<description>Set/clear operation on output 8. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[17:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR9</name>
							<description>Set/clear operation on output 9. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[19:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR10</name>
							<description>Set/clear operation on output 5. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[21:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR11</name>
							<description>Set/clear operation on output 11. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[23:22]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR12</name>
							<description>Set/clear operation on output 12. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[25:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR13</name>
							<description>Set/clear operation on output 13. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[27:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR14</name>
							<description>Set/clear operation on output 14. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[29:28]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR15</name>
							<description>Set/clear operation on output 15. Value 0x3 is reserved. Do not program this value.</description>
							<bitRange>[31:30]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on any counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_L</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE_H</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
