romanzhukovv/vscode-tools/cmsis-svd-master/data/NXP/LPC18xx_svd_v18.svd
				<register>
					<name>RES</name>
					<description>SCT conflict resolution register</description>
					<addressOffset>0x058</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>O0RES</name>
							<description>Effect of simultaneous set and clear on output 0.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR0 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_(OR_SET</name>
									<description>Clear output (or set based on the SETCLR0 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O1RES</name>
							<description>Effect of simultaneous set and clear on output 1.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR1 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_(OR_SET</name>
									<description>Clear output (or set based on the SETCLR1 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O2RES</name>
							<description>Effect of simultaneous set and clear on output 2.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR2 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_N_(OR_S</name>
									<description>Clear output n (or set based on the SETCLR2 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O3RES</name>
							<description>Effect of simultaneous set and clear on output 3.</description>
							<bitRange>[7:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR3 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_(OR_SET</name>
									<description>Clear output (or set based on the SETCLR3 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O4RES</name>
							<description>Effect of simultaneous set and clear on output 4.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR4 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_(OR_SET</name>
									<description>Clear output (or set based on the SETCLR4 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O5RES</name>
							<description>Effect of simultaneous set and clear on output 5.</description>
							<bitRange>[11:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR5 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_(OR_SET</name>
									<description>Clear output (or set based on the SETCLR5 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O6RES</name>
							<description>Effect of simultaneous set and clear on output 6.</description>
							<bitRange>[13:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR6 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_(OR_SET</name>
									<description>Clear output (or set based on the SETCLR6 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O7RES</name>
							<description>Effect of simultaneous set and clear on output 7.</description>
							<bitRange>[15:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR7 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_(OR_SET</name>
									<description>Clear output (or set based on the SETCLR7 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O8RES</name>
							<description>Effect of simultaneous set and clear on output 8.</description>
							<bitRange>[17:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR8 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_(OR_SET</name>
									<description>Clear output (or set based on the SETCLR8 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O9RES</name>
							<description>Effect of simultaneous set and clear on output 9.</description>
							<bitRange>[19:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR9 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_(OR_SET</name>
									<description>Clear output (or set based on the SETCLR9 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O10RES</name>
							<description>Effect of simultaneous set and clear on output 10.</description>
							<bitRange>[21:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR10 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_(OR_SET</name>
									<description>Clear output (or set based on the SETCLR10 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O11RES</name>
							<description>Effect of simultaneous set and clear on output 11.</description>
							<bitRange>[23:22]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR11 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_(OR_SET</name>
									<description>Clear output (or set based on the SETCLR11 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O12RES</name>
							<description>Effect of simultaneous set and clear on output 12.</description>
							<bitRange>[25:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR12 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_(OR_SET</name>
									<description>Clear output (or set based on the SETCLR12 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O13RES</name>
							<description>Effect of simultaneous set and clear on output 13.</description>
							<bitRange>[27:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR13 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_(OR_SET</name>
									<description>Clear output (or set based on the SETCLR13 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O14RES</name>
							<description>Effect of simultaneous set and clear on output 14.</description>
							<bitRange>[29:28]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR14 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_(OR_SET</name>
									<description>Clear output (or set based on the SETCLR14 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O15RES</name>
							<description>Effect of simultaneous set and clear on output 15.</description>
							<bitRange>[31:30]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT_(OR_CLEAR</name>
									<description>Set output (or clear based on the SETCLR15 field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT_(OR_SET</name>
									<description>Clear output (or set based on the SETCLR15 field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT_</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAREQ0</name>
					<description>SCT DMA request 0 register</description>
					<addressOffset>0x05C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DEV_0_0</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>DEV_0_1</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>DEV_0_2</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DEV_0_3</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>DEV_0_4</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>DEV_0_5</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>DEV_0_6</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>DEV_0_7</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>DEV_0_8</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>DEV_0_9</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>DEV_0_10</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>DEV_0_11</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>DEV_0_12</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>DEV_0_13</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>DEV_0_14</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>DEV_0_15</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[29:16]</bitRange>
						</field>
						<field>
							<name>DRL0</name>
							<description>A 1 in this bit makes the SCT set DMA request 0 when it loads the  Match_L/Unified registers from the Reload_L/Unified registers.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DRQ0</name>
							<description>This read-only bit indicates the state of DMA Request 0</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
