romanzhukovv/vscode-tools/cmsis-svd-master/data/NXP/LPC18xx_svd_v18.svd
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[15:12]</bitRange>
							
						</field>
						<field>
							<name>RX_WMARK</name>
							<description>FIFO threshold watermark level when receiving data to card.
When FIFO data count reaches greater than this number,
DMA/FIFO request is raised. During end of packet, request is
generated regardless of threshold programming in order to
complete any remaining data.
In non-DMA mode, when receiver FIFO threshold (RXDR)
interrupt is enabled, then interrupt is generated instead of DMA
request.
During end of packet, interrupt is not generated if threshold
programming is larger than any remaining data. It is responsibility
of host to read remaining bytes on seeing Data Transfer Done
interrupt.
In DMA mode, at end of packet, even if remaining bytes are less
than threshold, DMA request does single transfers to flush out any
remaining bytes before Data Transfer Done interrupt is set.
12 bits - 1 bit less than FIFO-count of status register, which is
13 bits.
Limitation: RX_WMark smaller than FIFO_DEPTH-2
Recommended: (FIFO_DEPTH/2) - 1; (means greater than
(FIFO_DEPTH/2) - 1)
NOTE: In DMA mode during CCS time-out, the DMA does not
generate the request at the end of packet, even if remaining bytes
are less than threshold. In this case, there will be some data left in
the FIFO. It is the responsibility of the application to reset the
FIFO after the CCS timeout.</description>
							<bitRange>[27:16]</bitRange>
							
						</field>
						<field>
							<name>DW_DMA_MUTIPLE_TRANSACTION_SIZE</name>
							<description>Burst size of multiple transaction; should be programmed same as
DW-DMA controller multiple-transaction-size SRC/DEST_MSIZE.The units for transfers is the H_DATA_WIDTH parameter. A single
transfer (dw_dma_single assertion in case of Non DW DMA
interface) would be signalled based on this value.
Value should be sub-multiple of (RX_WMark + 1)*
(F_DATA_WIDTH/H_DATA_WIDTH) and
(FIFO_DEPTH - TX_WMark)* (F_DATA_WIDTH/
H_DATA_WIDTH)
For example, if FIFO_DEPTH = 16,
FDATA_WIDTH == H_DATA_WIDTH
Allowed combinations for MSize and TX_WMark are:
MSize = 1, TX_WMARK = 1-15
MSize = 4, TX_WMark = 8
MSize = 4, TX_WMark = 4
MSize = 4, TX_WMark = 12
MSize = 8, TX_WMark = 8
MSize = 8, TX_WMark = 4. Allowed combinations for MSize and RX_WMark are:
MSize = 1, RX_WMARK = 0-14
MSize = 4, RX_WMark = 3
MSize = 4, RX_WMark = 7
MSize = 4, RX_WMark = 11
MSize = 8, RX_WMark = 7
MSize = 8, RX_WMark = 11
Recommended:
MSize = 8, TX_WMark = 8, RX_WMark = 7</description>
							<bitRange>[30:28]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>1TXF</name>
									<description>1 transfer</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4TXF</name>
									<description>4 transfers</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8TXF</name>
									<description>8 transfers</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16TXF</name>
									<description>16 transfers</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32TXF</name>
									<description>32 transfers</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64TXF</name>
									<description>64 transfers</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>128TXF</name>
									<description>128 transfers</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>256TXF</name>
									<description>256 transfers</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:31]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>CDETECT</name>
					<description>Card Detect Register</description>
					<addressOffset>0x50</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CARD_DETECT_N</name>
							<description>Value on card_detect_n input ports (1 bit per card); read-only bits.
0 represents presence of card. Only NUM_CARDS number of bits
are implemented.</description>
							<bitRange>[29:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:30]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>WRTPRT</name>
					<description>Write Protect Register</description>
					<addressOffset>0x54</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>WRITE_PROTECT</name>
							<description>Value on card_write_prt input ports (1 bit per card).
1 represents write protection. Only NUM_CARDS number of bits are
implemented.</description>
							<bitRange>[29:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:30]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIO</name>
					<description>General Purpose Input/Output Register</description>
					<addressOffset>0x58</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>GPI</name>
							<description>Value on gpi input ports; this portion of register is read-only. Valid only when
AREA_OPTIMIZED parameter is 0.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>GPO</name>
							<description>Value needed to be driven to gpo pins; this portion of register is read/write. Valid
only when AREA_OPTIMIZED parameter is 0.</description>
							<bitRange>[23:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TCBCNT</name>
					<description>Transferred CIU Card Byte Count Register</description>
					<addressOffset>0x5C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TRANS_CARD_BYTE_COUNT</name>
							<description>Number of bytes transferred by CIU unit to card.
In 32-bit or 64-bit AMBA data-bus-width modes, register should
be accessed in full to avoid read-coherency problems. In 16-bit
AMBA data-bus-width mode, internal 16-bit coherency register
is implemented. User should first read lower 16 bits and then
higher 16 bits. When reading lower 16 bits, higher 16 bits of
counter are stored in temporary register. When higher 16 bits
are read, data from temporary register is supplied.
Both TCBCNT and TBBCNT share same coherency register.
When AREA_OPTIMIZED parameter is 1, register should be
read only after data transfer completes; during data transfer,
register returns 0.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TBBCNT</name>
					<description>Transferred Host to BIU-FIFO Byte Count Register</description>
					<addressOffset>0x60</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TRANS_FIFO_BYTE_COUNT</name>
							<description>Number of bytes transferred between Host/DMA memory and BIU
FIFO.
In 32-bit or 64-bit AMBA data-bus-width modes, register should be
accessed in full to avoid read-coherency problems. In 16-bit AMBA
data-bus-width mode, internal 16-bit coherency register is
implemented. User should first read lower 16 bits and then higher
16 bits. When reading lower 16 bits, higher 16 bits of counter are
stored in temporary register. When higher 16 bits are read, data
from temporary register is supplied.
Both TCBCNT and TBBCNT share same coherency register.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DEBNCE</name>
					<description>Debounce Count Register</description>
					<addressOffset>0x64</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DEBOUNCE_COUNT</name>
							<description>Number of host clocks (clk) used by debounce filter logic; typical
debounce time is 5-25 ms.</description>
							<bitRange>[23:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>USRID</name>
					<description>User ID Register</description>
					<addressOffset>0x68</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>USRID</name>
							<description>User identification register; value set by user. Default reset value can be picked
by user while configuring core before synthesis.
Can also be used as scratch pad register by user.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>VERID</name>
					<description>Version ID Register</description>
					<addressOffset>0x6C</addressOffset>
					<access>read-only</access>
					<resetValue>0x5342230a</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VERID</name>
							<description>Synopsys version identification register; register value is hard-wired. Can be
read by firmware to support different versions of core.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>UHS_REG</name>
					<description>UHS-1 Register</description>
					<addressOffset>0x74</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VOLT_REG</name>
							<description>High Voltage mode. Determines the voltage fed to the buffers by an
external voltage regulator.
0 - Buffers supplied with 3.3V Vdd
1 - Buffers supplied with 1.8V Vdd
These bits function as the output of the host controller and are fed to an
external voltage regulator. The voltage regulator must switch the voltage
of the buffers of a particular card to either 3.3V or 1.8V, depending on the
value programmed in the register.
VOLT_REG[0] should be set to 1 for card number 0 in order to make it
operate for 1.8V.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>DDR_REG</name>
							<description>DDR mode. Determines the voltage fed to the buffers by an external
voltage regulator.
0 - Non-DDR mode
1 - DDR mode
UHS_REG [16] should be set for card number 0, UHS_REG [17] for card
number 1 and so on.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RST_N</name>
					<description>Hardware Reset</description>
					<addressOffset>0x78</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CARD_RESET</name>
							<description>Hardware reset.
1 - Active mode
0 - Reset
These bits cause the cards to enter pre-idle state, which requires them to
be re-initialized. CARD_RESET[0] should be set to 1 to reset card
number 0, and CARD_RESET[15] should be set to reset card number 15.
The number of bits implemented is restricted to NUM_CARDS.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>BMOD</name>
					<description>Bus Mode Register</description>
					<addressOffset>0x80</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SWR</name>
							<description>Software Reset. When set, the DMA Controller resets all its internal registers.
SWR is read/write. It is automatically cleared after 1 clock cycle.</description>
							<bitRange>[0:0]</bitRange>
							
