romanzhukovv/vscode-tools/cmsis-svd-master/data/NXP/LPC18xx_svd_v18.svd
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode.</description>
							<bitRange>[4:4]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode.</description>
							<bitRange>[5:5]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode. Writing a one to this bit when the device mode is selected, will have undefined results.</description>
							<bitRange>[6:6]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. These bits should be set to 0.</description>
							<bitRange>[7:7]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in Device mode.</description>
							<bitRange>[9:8]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.These bits should be set to 0.</description>
							<bitRange>[10:10]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in Device mode.</description>
							<bitRange>[11:11]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.These bits should be set to 0.</description>
							<bitRange>[12:12]</bitRange>
							
						</field>
						<field>
							<name>SUTW</name>
							<description>Setup trip wire  During handling a setup packet, this bit is used as a semaphore to ensure that the setup data payload of 8 bytes is extracted from a QH by the DCD without being corrupted. If the setup lockout mode is off (see USBMODE register) then there exists a hazard when new setup data arrives while the DCD is copying the setup data payload from the QH for a previous setup packet. This bit is set and cleared by software and will be cleared by hardware when a hazard exists. (See Section 18.10).</description>
							<bitRange>[13:13]</bitRange>
							
						</field>
						<field>
							<name>ATDTW</name>
							<description>Add dTD trip wire This bit is used as a semaphore to ensure the to proper addition of a new dTD to an active (primed) endpoint's linked list. This bit is set and cleared by software during the process of adding a new dTD. See also Section 18.10. This bit shall also be cleared by hardware when its state machine is hazard region for which adding a dTD to a primed endpoint may go unrecognized.</description>
							<bitRange>[14:14]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode.</description>
							<bitRange>[15:15]</bitRange>
							
						</field>
						<field>
							<name>ITC</name>
							<description>Interrupt threshold control. The system software uses this field to set the maximum rate at which the host/device controller will issue interrupts. ITC contains the maximum interrupt interval measured in micro-frames. Valid values are shown below. All other values are reserved. 0x0 = Immediate (no threshold) 0x1 = 1 micro frame. 0x2 = 2 micro frames. 0x8 = 8 micro frames. 0x10 = 16 micro frames. 0x20 = 32 micro frames. 0x40 = 64 micro frames.</description>
							<bitRange>[23:16]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:24]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>USBCMD_H</name>
					<description>USB command (host mode)</description>
					<alternateRegister>USBCMD_D</alternateRegister>
					<addressOffset>0x140</addressOffset>
					<access>read-write</access>
					<resetValue>0x00080000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RS</name>
							<description>Run/Stop</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>HALT</name>
									<description>When this bit is set to 0, the Host Controller completes the current transaction on the USB and then halts. The HC Halted bit in the status register indicates when the Host Controller has finished the transaction and has entered the stopped state. Software should not write a one to this field unless the host controller is in the Halted state (i.e. HCHalted in the USBSTS register is a one).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PROCEED</name>
									<description>When set to a 1, the Host Controller proceeds with the execution of the schedule. The Host Controller continues execution as long as this bit is set to a one.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RST</name>
							<description>Controller reset.  Software uses this bit to reset the controller. This bit is set to zero by the Host/Device Controller when the reset process is complete. Software cannot terminate the reset process early by writing a zero to this register.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RESETCOMPLETE</name>
									<description>This bit is set to zero by hardware when the reset process is complete.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>When software writes a one to this bit, the Host Controller resets its internal pipelines, timers, counters, state machines etc. to their initial value. Any transaction currently in progress on USB is immediately terminated. A USB reset is not driven on downstream ports. Software should not set this bit to a one when the HCHalted bit in the USBSTS register is a zero. Attempting to reset an actively running host controller will result in undefined behavior.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FS0</name>
							<description>Bit 0 of the Frame List Size bits. See Table 220. This field specifies the size of the frame list that controls which bits in the Frame Index Register should be used for the Frame List Current index. Note that this field is made up from USBCMD bits 15, 3, and 2.</description>
							<bitRange>[2:2]</bitRange>
							
