romanzhukovv/vscode-tools/cmsis-svd-master/data/NXP/LPC18xx_svd_v18.svd
						</field>
						<field>
							<name>PE</name>
							<description>Port enable. This bit is always 1. The device port is always enabled.</description>
							<bitRange>[2:2]</bitRange>
							
						</field>
						<field>
							<name>PEC</name>
							<description>Port enable/disable change This bit is always 0. The device port is always enabled.</description>
							<bitRange>[3:3]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[5:4]</bitRange>
							
						</field>
						<field>
							<name>FPR</name>
							<description>Force port resume After the device has been in Suspend State for 5 ms or more, software must set this bit to one to drive resume signaling before clearing. The Device Controller will set this bit to one if a J-to-K transition is detected while the port is in the Suspend state. The bit will be cleared when the device returns to normal operation. When this bit transitions to a one because a J-to-K transition detected, the Port Change Detect bit in the USBSTS register is set to one as well.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_RESUME_(K_STATE)_</name>
									<description>No resume (K-state) detected/driven on port.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESUME_DETECTED/DRIV</name>
									<description>Resume detected/driven on port.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUSP</name>
							<description>Suspend In device mode, this is a read-only status bit .</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PORT_NOT_IN_SUSPEND_</name>
									<description>Port not in suspend state</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORT_IN_SUSPEND_STAT</name>
									<description>Port in suspend state</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PR</name>
							<description>Port reset In device mode, this is a read-only status bit. A device reset from the USB bus is also indicated in the USBSTS register.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PORT_IS_NOT_IN_THE_R</name>
									<description>Port is not in the reset state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORT_IS_IN_THE_RESET</name>
									<description>Port is in the reset state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HSP</name>
							<description>High-speed status This bit is redundant with bits 27:26 (PSPD) in this register. It is implemented for compatibility reasons.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_HIGHSSPEED</name>
									<description>Host/device connected to the port is not in High-speed mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHSPEED</name>
									<description>Host/device connected to the port is in High-speed mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode.</description>
							<bitRange>[11:10]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode.</description>
							<bitRange>[12:12]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[13:13]</bitRange>
							
						</field>
						<field>
							<name>PIC1_0</name>
							<description>Port indicator control Writing to this field effects the value of the USB0_IND[1:0] pins.</description>
							<bitRange>[15:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>OFF</name>
									<description>Port indicators are off.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AMBER</name>
									<description>amber</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GREEN</name>
									<description>green</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNDEFINED</name>
									<description>undefined</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PTC3_0</name>
							<description>Port test control Any value other than 0000 indicates that the port is operating in test mode. The FORCE_ENABLE_FS and FORCE ENABLE_LS are extensions to the test mode support specified in the EHCI specification. Writing the PTC field to any of the FORCE_ENABLE_HS/FS/LS values will force the port into the connected and enabled state at the selected speed. Writing the PTC field back to TEST_MODE_DISABLE will allow the port state machines to progress normally from that point. Values 0111 to 1111 are not valid.</description>
							<bitRange>[19:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TEST_MODE_DISABLE</name>
									<description>TEST_MODE_DISABLE</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>J_STATE</name>
									<description>J_STATE</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>K_STATE</name>
									<description>K_STATE</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SE0_(HOST)/NAK_(DEVI</name>
									<description>SE0 (host)/NAK (device)</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PACKET</name>
									<description>Packet</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORCE_ENABLE_HS</name>
									<description>FORCE_ENABLE_HS</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORCE_ENABLE_FS</name>
									<description>FORCE_ENABLE_FS</description>
									<value>0x6</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode. This bit is always 0 in device mode.</description>
							<bitRange>[20:20]</bitRange>
							
