romanzhukovv/vscode-tools/cmsis-svd-master/data/NXP/LPC18xx_svd_v18.svd
				<register>
					<name>RESET_EXT_STAT45</name>
					<description>Reset external status register</description>
					<addressOffset>0x04B4</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT46</name>
					<description>Reset external status register</description>
					<addressOffset>0x04B8</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT47</name>
					<description>Reset external status register</description>
					<addressOffset>0x04BC</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT48</name>
					<description>Reset external status register</description>
					<addressOffset>0x04C0</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT49</name>
					<description>Reset external status register</description>
					<addressOffset>0x04C4</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT50</name>
					<description>Reset external status register</description>
					<addressOffset>0x04C8</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT51</name>
					<description>Reset external status register</description>
					<addressOffset>0x04CC</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT52</name>
					<description>Reset external status register</description>
					<addressOffset>0x04D0</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT53</name>
					<description>Reset external status register</description>
					<addressOffset>0x04D4</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT54</name>
					<description>Reset external status register</description>
					<addressOffset>0x04D8</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>								
				<register>
					<name>RESET_EXT_STAT55</name>
					<description>Reset external status register</description>
					<addressOffset>0x04DC</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
