romanzhukovv/vscode-tools/cmsis-svd-master/data/NXP/LPC18xx_svd_v18.svd
			</registers>
		</peripheral>

		<peripheral>
			<name>GIMA</name>
			<description>Product name title=Falcon Chapter title=Global Input Multiplexer Array (GIMA) Modification date=3/25/2011 Major revision=0 Minor revision=4 </description>
			<groupName>GIMA</groupName>
			<baseAddress>0x400C7000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CAP0_0_IN</name>
					<description>Timer 0 CAP0_0  capture input multiplexer</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOINVERT</name>
									<description>Not inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVERT</name>
									<description>Input inverted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGE</name>
							<description>Enable rising edge detection</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOEDGE</name>
									<description>No edge detection.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISINGEDGE</name>
									<description>Rising edge detection enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNCH</name>
							<description>Enable 2ff synchronization</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable 2ff synchronization.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable 2ff synchronization.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PULSE</name>
							<description>Enable single pulse generation.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable single pulse generation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable single pulse generation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SELECT</name>
							<description>Select input. Values 0x3 to 0xF are reserved.</description>
							<bitRange>[7:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CTIN_0</name>
									<description>CTIN_0</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T0_CAP0</name>
									<description>T0_CAP0</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>CAP0_1_IN</name>
					<description>Timer 0 CAP0_1  capture input multiplexer</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOINVERT</name>
									<description>Not inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVERT</name>
									<description>Input inverted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGE</name>
							<description>Enable rising edge detection</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOEDGE</name>
									<description>No edge detection.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISINGEDGE</name>
									<description>Rising edge detection enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNCH</name>
							<description>Enable 2ff synchronization</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable 2ff synchronization.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable 2ff synchronization.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PULSE</name>
							<description>Enable single pulse generation.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable single pulse generation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable single pulse generation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SELECT</name>
							<description>Select input. Values 0x3 to 0xF are reserved.</description>
							<bitRange>[7:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CTIN_1</name>
									<description>CTIN_1</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U2_TXD</name>
									<description>U2_TXD</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T0_CAP1</name>
									<description>T0_CAP1</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
							
