romanzhukovv/vscode-tools/cmsis-svd-master/data/NXP/LPC18xx_svd_v18.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="C_CAN1">
			<name>C_CAN0</name>
			<baseAddress>0x400E2000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>C_CAN0</name>
				<value>51</value>
			</interrupt>
		</peripheral>

		<peripheral>
			<name>ADC0</name>
			<description>Product name title=UM10430 Chapter title=LPC18xx 10-bit ADC0/1 Modification date=1/18/2011 Major revision=0 Minor revision=7 </description>
			<groupName>ADC</groupName>
			<baseAddress>0x400E3000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC0</name>
				<value>17</value>

			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<description>A/D Control Register. The AD0CR register must be written to select the operating mode before A/D conversion can occur.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEL</name>
							<description>Selects which of the ADC[7:0] pins are to be sampled and converted. Bit 0 selects Pin ADC0, bit 1 selects pin AD1,..., and bit 7 selects pin ADC7. In software-controlled mode, only one of these bits should be 1. In hardware scan mode, any value containing 1 to 8 ones. All zeroes is equivalent to 0x01.</description>
							<bitRange>[7:0]</bitRange>
							
						</field>
						<field>
							<name>CLKDIV</name>
							<description>The ADC clock is divided by the CLKDIV value plus one to produce the clock for the A/D converter, which should be less than or equal to 4.5 MHz. Typically, software should program the smallest value in this field that yields a clock of 4.5 MHz or slightly less, but in certain cases (such as a high-impedance analog source) a slower clock may be desirable.</description>
							<bitRange>[15:8]</bitRange>
							
						</field>
						<field>
							<name>BURST</name>
							<description>Burst mode</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SOFTWARE</name>
									<description>Conversions are software controlled and require 11 clocks.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BURST</name>
									<description>The AD converter does repeated conversions at the rate selected by the CLKS field, scanning (if necessary) through the pins selected by 1s in the SEL field. The first conversion after the start corresponds to the least-significant 1 in the SEL field, then higher numbered 1 bits (pins) if applicable. Repeated conversions can be terminated by clearing this bit, but the conversion that is  in progress when this bit is cleared will be completed. Important: START bits must be 000 when BURST = 1 or conversions will not start.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKS</name>
							<description>This field selects the number of clocks used for each conversion in Burst mode, and the number of bits of accuracy of the result in the LS bits of ADDR, between 11 clocks (10 bits) and 4 clocks (3 bits).</description>
							<bitRange>[19:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>11_CLOCKS_/_10_BITS</name>
									<description>11 clocks / 10 bits</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10_CLOCKS_/_9_BITS</name>
									<description>10 clocks / 9 bits</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_CLOCKS_/_8_BITS</name>
									<description>9 clocks / 8 bits</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_CLOCKS_/_7_BITS</name>
									<description>8 clocks / 7 bits</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_CLOCKS_/_6_BITS</name>
									<description>7 clocks / 6 bits</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_CLOCKS_/_5_BITS</name>
									<description>6 clocks / 5 bits</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_CLOCKS_/_4_BITS</name>
									<description>5 clocks / 4 bits</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_CLOCKS_/_3_BITS</name>
									<description>4 clocks / 3 bits</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[20:20]</bitRange>
							
						</field>
						<field>
							<name>PDN</name>
							<description>Power mode</description>
							<bitRange>[21:21]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>POWERDOWN</name>
									<description>The A/D converter is in Power-down mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RUNNING</name>
									<description>The A/D converter is operational.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[23:22]</bitRange>
							
